Repository: DTJF/GladeToBac
Catalog: locale/*/LC_MESSAGES/GladeToBac.po
Languages: de

source: Load GUI-XML-file:
de: GUI-XML-Datei laden:

source: Help function
de: Hilfe Funktion

source: ReadMe
de: LiesMich

source: Command-line-help
de: Hilfe aus Kommandozeile

source: Save parameters
de: Parameter speichern

source: Short help (for details see '
de: Kurzhilfe (Details siehe '

source: Synopsis:
de: Beschreibung:

source: FILE
de: Datei

source: -OPTIONS
de: -Optionen

source: Example:
de: Beispiel:

source: Executes:
de: Bearbeitet:

source: in folder
de: im Ordner

source: Options:
de: Optionen:

source: confirm sketching, external GUI-file,
de: Generierung bestätigen, externe GUI-XML-Datei,

source: create .pot file, use tobac folder
de: .pot-Datei erzeugen, tobac Ordner verwenden

source: runs through the steps
de: führt folgende Bearbeitungsschritte aus

source: 1.) load GUI-XML-file and analyse
de: 1.) GUI-XML-Datei laden und analysieren

source: 2.) write .bas sources (switched by -n or -N)
de: 2.) .bas-Dateien erzeugen (siehe Optionen -n, -N)

source: 3.) create .pot file (switched by -x)
de: 3.) .pot-Datei erzeugen (siehe Option -x)

source: 4.) delete deprecated files (switched by -a or -A)
de: 4.) veraltete Dateien löschen (siehe Optionen -a, -A)

source: If no regular file is specified the GUI will start.
de: Grafische Oberfläche startet, wenn kein gültiger Dateiname spezifiziert ist.

source: Options (use minus all times, separated by space):
de: Optionen (Minuszeichen immer verwenden, Trennung durch Leerzeichen):

source: -h help (print this text and end)
de: -h Hilfe (diesen Text ausgeben und beenden)

source: -v version: show version info and end
de: -v Versions-Information ausgeben und beenden

source: -a run clean-up funktion, confirm deleting
de: -a Funktion Ausmisten, lösche nach Bestätigung

source: -A run clean-up funktion, delete without confirmation
de: -A Funktion Ausmisten, lösche ohne Bestätigung

source: -C GUI block: do not start GUI on error
de: -C GUI bei Fehler nicht starten

source: -g include GUI-XML-file in code (for final version)
de: -g GUI-XML-Datei in Quelltext integrieren (für Endversion)

source: -G do not include GUI-XML-file in code
de: -G GUI-XML-Datei nicht in den Quelltext integrieren

source: -i I18N support in main file (*.bas)
de: -i I18N Unterstuetzung in Hauptdatei (*.bas)

source: -I no I18N support in main file (*.bas)
de: -I keine I18N Unterstuetzung

source: -n NoAction: analyse file, confirm .bas code sketching
de: -n NoAction: GUI-XML-Datei analysieren, Bearbeitung erst nach Bestätigung

source: -N NoAction: analyse file, no .bas code sketching at all
de: -N NoAction: GUI-XML-Datei nur analysieren

source: -t tobac folder: generate and use it
de: -t tobac-Ordner erzeugen und benutzen

source: -T files in current folder (no use of tobac-folder)
de: -T Dateien im Hauptverzeichnis (keine tobac-Ordner)

source: -x run xgettext to I18N: create .pot file (in current folder)
de: -x xgettext aufrufen zur Erzeugung der .pot-Datei

source: Values form .ini-file are used (overwrite by -g-G-i-I-t-T).
de: Vorgaben aus .ini-Datei können mit -g,-G,-i,-I,-t,-T überschrieben werden.

source: To use aditional functions => start with GUI.
de: Alle weiteren Funktionen werden im GUI aufgerufen.

source: insert code
de: Quelltext einfügen

source: File
de: Datei

source: Written
de: Geschrieben

source: Read
de: Gelesen

source: Empty file
de: Datei leer

source: License
de: Lizenz

source: Description
de: Beschreibung

source: _Run project
de: _Projekt ausführen

source: _Compile project
de: Projekt kompilieren

source: definitions found
de: Definitionen gefunden

source: Wellcome
de: Willkommen

source: to
de: bei

source: Start GUI
de: Starte GUI

source: _Yes
de: _Ja

source: _No
de: _Nein

source: _Cancel
de: _Abbruch

source: Sketching
de: Erzeugen

source: Yes
de: Ja

source: No
de: Nein

source: Cancel
de: Abbruch

source: no XML file
de: keine XML-Datei

source: Cannot open folder
de: Kann Ordner nicht öffnen

source: Folder
de: Ordner

source: >> Cannot open file
de: >> Lesefehler

source: User defined
de: Benutzerdefiniert

source: licenses found
de: Lizenzen gefunden

source: Unknown file name
de: Ungültiger Dateiname

source: Clean up
de: Ausmisten

source: Marking
de: Markieren

source: there are
de: es sind

source: files deprecated
de: Dateien veraltet

source: there is
de: es ist

source: file deprecated
de: Datei veraltet

source: To do
de: Aktion

source: Delete _All
de: Alle _löschen

source: Delete _Single
de: _Einzeln löschen

source: _No deleting
de: _Abbruch

source: Delete all
de: Alle löschen

source: Delete single
de: Einzeln löschen

source: No deleting
de: Abbruch

source: Sketching bas files
de: Erzeuge .bas-Dateien

source: Done
de: Fertig

source: Error: Can't run
de: Laufzeitfehler

source: Generating
de: Erzeuge

source: file for I18N
de: I18N-Datei

source: Error: Can't write to
de: Fehler: kann nicht schreiben auf

source: Creating project files
de: Projekt-Dateien erzeugen

source: Load / analyse
de: Laden / Analysieren

source: I18N support
de: I18N Quelltext =

source: on
de: ein

source: off
de: aus

source: Setting default values
de: Setze Standardwerte

source: existing:
de: vorhanden:

source: to be writen:
de: wird erzeugt:

source: New_file
de: Neue_Datei

source: RESULTS
de: ERGEBNISSE

source: nam. Widgets
de: ben. Widgets

source: This handler names cannot be used in fbc / gas
de: Diese Signalhandler-Namen sind in fbc / gas ungültig

source: Rename properly before further operation!
de: Vor weiterer Bearbeitung erst eine geeignete Benennung wählen!

source: existing
de: vorhanden

source: staying unchanged
de: bleiben unverändert

source: new
de: neu

source: to be written
de: werden erzeugt

source: deprecated
de: veraltet

source: may be cleaned up
de: ggf. ausmisten

source: delete
de: lösche

source: Error: can't kill
de: Fehler: kann nicht löschen

source: Deleted
de: Gelöscht

source: ERROR
de: FEHLER

source: end application
de: Programm beenden

source: Generate _FB files
de: Erzeuge _FB-Dateien

source: write files: -> *_tobac.bas (allways) -> *.bas and callbacks *.bas (if not exists) -> GUI-source *_gui.bas (if required) [active after GUI-XML-file loaded]
de: Dateien erzeugen: -> *_tobac.bas (immer) -> *.bas and callbacks *.bas (wenn nicht vorhanden) -> GUI-source *_gui.bas (wenn ausgewählt) [aktiv wenn GUI-XML-Datei geladen]

source: generate _pot file (I18N)
de: erzeuge _pot-Datei (I18N)

source: scan translatable texts in source files and generate a *.pot file for poedit (*.bas in main folder and tobac folder, *.ui/*.glade in main folder) [active after GUI-XML-file loaded]
de: suche übersetzbare Texte im Quelltext und erzeuge eine *.pot-Datei für poedit (*.bas/*.bi im Projektordner und tobac Ordner, *.ui/*.glade im Projektordner) [aktiv wenn GUI-XML-Datei geladen]

source: _Load / analyse
de: _Laden / Analysieren

source: _Load
de: _Laden

source: choose GUI-XML-file (*.ui/*.glade), load and check it for further processing (read-only operations)
de: wähle GUI-XML-Datei (*.ui/*.glade), lade und analysiere für weitere Bearbeitung (nur Lesezugriffe)

source: FreeBasic code sketcher
de: FreeBasic Quelltext-Generator

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>.
de: Dieses Programm ist freie Software. Sie kann weitergegeben oder modifiziert werden unter den Bedingungen der GNU General Public Lizenz, wie sie von der Free Software Foundation herausgegeben wird, entweder in der Version 3 oder (nach eigenem Ermessen) einer höheren Versionsnummer. Dieses Programm wurde erstellt in der Absicht eine nutzvolle Software zu erzeugen. Die Anwendung durch den Benutzer erfolgt ohne jede Gewähr- leistung und ohne Zusage einer speziellen Anwendbarkeit. Einzelheiten entnehmen Sie bitte der oben erwähnten Lizenz. Sie sollten eine Kopie dieser Lizenz mit dieser Software erhalten haben. Ggf. finden Sie den Originaltext unter <http://www.gnu.org/licenses/>.

source: Thomas.Freiherr@gmx.net
de: Thomas[ dot ]Freiherr{ at }gmx{dot}net

source: _File
de: _Datei

source: Save _project parameters
de: _Projekt Parameter speichern

source: Save parameters: CURPATH/GTK+tobac.ini. [active after GUI-XML-file loaded]
de: Parameter speichern: Projektordner/GladeToBac.ini [aktiv wenn GUI-XML-Datei geladen]

source: Save _default parameters
de: Standar_d Parameter speichern

source: Save parameters: EXEPATH/GTK+tobac.ini.
de: Parameter speichern: Programmordner/GladeToBac.ini

source: _Clean-up
de: _Ausmisten

source: check for deprecated callbacks *.bas and offer to delete them. [active after GUI-XML-file loaded]
de: suche veraltete Callbacks und biete deren Löschung an. [aktiv wenn GUI-XML-Datei geladen]

source: _Execute
de: _Bearbeite

source: Generate _pot file (_I18N)
de: Erzeuge _pot-Datei (_I18N)

source: Generate _project files
de: Erzeuge _Projekt-Dateien

source: write required project files (existing files don't get touched) [active after GUI-XML-file loaded]
de: Erzeuge die ausgewählten Projekt-Dateien (vorhandene bleiben unverändert) [aktiv wenn GUI-XML-Datei geladen]

source: _Help
de: _Hilfe

source: show file ReadMe.txt and command line help in output tab
de: Anzeigen von LiesMich.txt und der Kommandozeilen-Hilfe im Ausgabe-Fenster

source: show info about this application
de: Informationen über dieses Programm anzeigen

source: Generate .bas
de: Erzeugen .bas

source: Quit
de: Beenden

source: _Synopsis:
de: _Kurzbeschr.:

source: Short description of Project. (used in *.bas, make, ReadMe.txt, *.geany, *.fbp) A long version will be imported from the file *.desc, if exists. (used in *.bas, ReadMe.txt)
de: Projekt-Kurzbeschreibung: (verwendet in *.bas, make, ReadMe.txt, *.geany, *.fbp) Eine ausführliche Beschreibung wird ggf. aus der Datei *.desc geladen. (*.desc verwendet in *.bas, ReadMe.txt)

source: Choose license (used in *.bas, make, ReadMe.txt)
de: Wähle Lizenz: (verwendet in *.bas, make, ReadMe.txt)

source: Start version of project. Later, the version will be red from *.bas, if exists.
de: Versionsnummer des Projektes. (Ggf. wird diese durch die Versionsnummer aus der *.bas-Datei ersetzt.)

source: Insert webside URL, e.g. 'http://www.meins.net' (used in *.bas, make, ReadMe.txt)
de: Webseiten-URL, z. B. 'http://www.meins.net' (verwendet in *.bas, make, ReadMe.txt)

source: Insert Email adress, e.g. 'My.Name@home.net' (! mind spamers !) (used in *.bas, *.po, make, ReadMe.txt)
de: Email-Adresse, z. B. 'My.Name@home.net' (! Spamgefahr !) (verwendet in *.bas, *.po, make, ReadMe.txt)

source: Insert Name (used in *.bas, *.po, make, ReadMe.txt, *.rc)
de: Name des Autors (verwendet in *.bas, *.po, make, ReadMe.txt, *.rc)

source: _Author:
de: _Autor:

source: _Website:
de: _Webseite:

source: Name of TYPE-definition, used for UI-variables (references to widgets/Objects). When empty: all UI-variables are global.
de: Name der TYPE-Struktur, verwendet für UI-Variablen (Widget-/Objekt-Referenzen). Wenn leer: alle UI-Variablen sind global.

source: I18_N support
de: I18_N Unterstützung

source: When aktiv: generate code to include and initialise libintl for internationalisation
de: Wenn aktiv: erzeuge Quelltext zum Einbinden und Initialisieren von libintl für Internationalisierung

source: _tobac folder
de: _tobac Ordner

source: When active: generate *_tobac.bas [*_gui.bas] and callbacks *.bas in subfolder tobac.
de: Wenn aktiv: erzeuge *_tobac.bas [*_gui.bas] und callbacks *.bas im Unterordner tobac.

source: <b>New project</b>
de: <b>Neues Projekt</b>

source: GUI _in source
de: GUI _im Quelltext

source: When active: generate *_gui.bas and include the file into the source code. In this case the GUI-XML-file needs NOT to be shiped with the binary.
de: Wenn aktiv: erzeuge *_gui.bas und binde die Datei in den Quelltext ein. In diesem Fall ist das Kompilat ohne GUI-XML-Datei ausführbar.

source: This GTK+ version gets checked at startup (ie '2.16'). Minimum is 2.8. When empty: no version check gets performed.
de: Diese GTK-Version wird in *_tobac.bas geprüft (z. B. '2.16'). Falls zur Laufzeit eine kleinere GTK-Version gefunden wird, bricht das Programm ab. Minimalversion 2.8. Wenn leer: es wird kein Quelltext zur Versionsprüfung erzeugt

source: <b>New project_tobac.bas</b>
de: <b>Neues Projekt_tobac.bas</b>

source: When active: generate 'readme.txt' in main folder, if not exists
de: Wenn aktiv: erzeuge 'readme.txt' im Projektordner, wenn noch nicht vorhanden

source: When active: generate 'makefile' in main folder, if not exists
de: Wenn aktiv: erzeuge 'makefile' im Projektordner, wenn noch nicht vorhanden

source: When active: generate Geany project file '*.geany' in main folder, if not exists
de: Wenn aktiv: erzeuge Geany Projekt-Datei '*.geany' im Projektordner, wenn noch nicht vorhanden

source: When active: generate FB-IDE project file '*.fbide.fbp' in main folder, if not exists
de: Wenn aktiv: erzeuge FB-IDE Projekt-Datei '*.fbide.fbp' im Projektordner, wenn noch nicht vorhanden

source: When active: generate FB-Edit-Projekt-file '*.fbp' in main folder, if not exists
de: Wenn aktiv: erzeuge FB-Edit-Projekt-Datei '*.fbp' im Projektordner, wenn noch nicht vorhanden

source: When active: generate Jelly-Projekt-file '*.jfp' in main folder, if not exists
de: When aktiv: erzeuge Jelly-Projekt-Datei '*.jfp' im Projektordner, wenn noch nicht vorhanden

source: When active: generate Windows-Resource-Datei '*.rc' in main folder, if not exists
de: Wenn aktiv: erzeuge Windows-Resource-Datei '*.rc' im Porjektordner, wenn noch nicht vorhanden

source: When active: bind Icon file '*.ico' in Windows Resource file (*.rc)
de: Wenn aktiv: binde Icon-Datei '*.ico' in Windows Resource Datei (*.rc)

source: <b>Project files</b>
de: <b>Projekt Dateien</b>

source: _Parameters
de: _Parameter

source: _Outputs
de: _Ausgabe
